cf_billing/Documents/энргОперацияСТочкамиПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОперацияСТочкамиПоставки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПараметрыТочекПоставки</xr:Item>
				<xr:Item>InformationRegister.энргАктивностьТочекПоставки</xr:Item>
				<xr:Item>InformationRegister.энргКатегорииНадежностиТочекПоставок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкиПриема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиПоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяМощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрисоединеннаяМощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СетеваяОрганизация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктураСети</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньНапряжения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньНапряженияРасчетный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргУровниНапряжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияНадежности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргКатегорииНадежности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТочкиПоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыТехнологическогоПрисоединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АктТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАктыТехнологическогоПрисоединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаПрисоединения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРынка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргВидыРынка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмежныйСубъектОРЭМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитыПСИ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПередачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтделениеЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АктРазграниченияБалансовойПринадлежности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАктыРазграниченияБалансовойПринадлежности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НапряжениеГБП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииНадежности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияНадежности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргКатегорииНадежности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТомЧисле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргОперацияСТочкамиПоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		=  Параметры.ключ.Видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран  тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргОперацияСТочкамиПоставки",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;	
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","энргОперацияСТочкамиПоставки");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;

	ДобавитьТекстЗапросаАктивностьТочекПоставки(Схема, Регистры);
	ДобавитьТекстЗапросаПараметрыТочекПоставки(Схема, Регистры);
	ДобавитьТекстЗапросаКатегорииНадежностиТочекПоставок(Схема, Регистры);
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаАктивностьТочекПоставки(Схема, Регистры)
	
	ИмяРегистра = "энргАктивностьТочекПоставки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки) КАК Состояние
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В (&мДокументы)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаПараметрыТочекПоставки(Схема, Регистры)
	
	ИмяРегистра = "энргПараметрыТочекПоставки";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.МаксимальнаяМощность КАК МаксимальнаяМощность,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ПрисоединеннаяМощность КАК ПрисоединеннаяМощность,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СетеваяОрганизация КАК СетеваяОрганизация,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СтруктураСети КАК СтруктураСети,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.УровеньНапряжения КАК УровеньНапряжения,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.УровеньНапряженияРасчетный КАК УровеньНапряженияРасчетный,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ДоговорТП КАК ДоговорТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.АктТП КАК АктТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПрисоединения КАК ТочкаПрисоединения,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ГТП КАК ГТП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ВидРынка КАК ВидРынка,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.СмежныйСубъектОРЭМ КАК СмежныйСубъектОРЭМ,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.РеквизитыПСИ КАК РеквизитыПСИ,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ДоговорПокупки КАК ДоговорПокупки,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ОтделениеЭК КАК ОтделениеЭК,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.НапряжениеГБП КАК НапряжениеГБП,
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.АктРазграниченияБалансовойПринадлежности КАК АктРазграниченияБалансовойПринадлежности
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В(&мДокументы)
	|	И энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКатегорииНадежностиТочекПоставок(Схема, Регистры)
	
	ИмяРегистра = "энргКатегорииНадежностиТочекПоставок";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргОперацияСТочкамиПоставкиТочкиПоставки.ТочкаПоставки КАК ТочкаПоставки,
	|	энргОперацияСТочкамиПоставки.Дата КАК Период,
	|	энргОперацияСТочкамиПоставкиКатегорииНадежности.КатегорияНадежности КАК КатегорияНадежности,
	|	энргОперацияСТочкамиПоставкиКатегорииНадежности.ВТомЧисле КАК ВТомЧисле
	|ИЗ
	|	Документ.энргОперацияСТочкамиПоставки.ТочкиПоставки КАК энргОперацияСТочкамиПоставкиТочкиПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки КАК энргОперацияСТочкамиПоставки
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргОперацияСТочкамиПоставки.КатегорииНадежности КАК энргОперацияСТочкамиПоставкиКатегорииНадежности
	|		ПО энргОперацияСТочкамиПоставкиТочкиПоставки.Ссылка = энргОперацияСТочкамиПоставкиКатегорииНадежности.Ссылка
	|			И энргОперацияСТочкамиПоставкиТочкиПоставки.IDСтроки = энргОперацияСТочкамиПоставкиКатегорииНадежности.IDСтроки
	|ГДЕ
	|	энргОперацияСТочкамиПоставки.Ссылка В(&мДокументы)
	|	И энргОперацияСТочкамиПоставки.ВидОперации = ЗНАЧЕНИЕ(перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки)";		
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
